Repository: ndahlquist-cc/ASP.NET
Catalog: NDSailing/NDSailing/App_GlobalResources/NDTranslations.*.resx
Languages: fi, nl

source: City
fi: Kaupunki
nl: Stad

source: Comment
fi: Kommentti
nl: Commentaar

source: First Name
fi: Etunimi
nl: Voornaam

source: Full Name
fi: Koko nimi
nl: Volledige Naam

source: Home Phone
fi: Kotipuhelin
nl: Telefoon Thuis

# lastName
source: Family Name
fi: Sukunimi
nl: Familie Naam

source: Member ID
fi: Jäsen tunnus
nl: Lid ID

source: Postal Code
fi: Postinumero
nl: Postcode

# provinceCode
source: Province
fi: Maakunta
nl: Provincie

# Required
source: {0} cannot be empty or just blanks
fi: {0} ei voi olla tyhjä tai vain aihioita
nl: {0} kan niet leeg of alleen spaties zijn

# spouseFirstName
source: Spouse's First Name
fi: Puolison etunimi
nl: Echtgenoot Voornaam

# spouseLastName
source: Spouse's Last Name
fi: Puolison sukunimi
nl: Partner 'wordt

source: Street
fi: Katu
nl: Straat

# StringLengthMinMax
source: {0} must be from {1} to {2} characters long
fi: {0} täytyy olla {1} ja {2} merkkiä pitkä
nl: {0} moet zijn van {1} tot {2} tekens lang zijn

source: Task Exempt
fi: Tehtävä Vapautettu
nl: Task Vrijgesteld

source: Use Canada Post
fi: Käytä Kanada Virka
nl: Gebruik de Post van Canada

source: Year Joined
fi: Vuosi Liittyi
nl: Jaar Geregistreerd

# postalError
source: {0} must be in the format A1A 1A1
fi: {0} on oltavamuodossa A1A 1A1
nl: {0} moet in het formaat A1A 1A1

source: Province
fi: Maakunta
nl: Provincie

source: Creation Successful
fi: Luominen Onnistunut
nl: Creatie Succesvolle

source: Delete
fi: Poistaa
nl: Verwijderen

source: Details
fi: Tarkemmat Tiedot
nl: Meer Informatie

source: Edit
fi: Muokata
nl: Uitgeven

source: Member Listing
fi: Listaus
nl: lis Listing

source: About
fi: Noin
nl: Over

source: Back to List
fi: Takaisin Luetteloon
nl: Terug naar de lijst

source: Change Language
fi: Vaihda Kieli
nl: Taal wijzigen

source: Contact
fi: Yhteyshenkilö

# create
source: Create New
fi: Luoda Uusia
nl: creëren nieuw

source: Create Member
fi: Luo Jäsen
nl: Maak Lid

# deleteSure
source: Are you sure you want to delete this?
fi: Oletko varma, että haluat poistaa tämän ?
nl: Bent u zeker dat u dit wilt verwijderen ?

# downwind
source: Downwind Tack Sailing Club
fi: Myötätuuleen Nasta Purjehdus Klubi
nl: Benedenwinds Kleverigheid Zeilend Club

source: Edit Member
fi: Muokkaa Jäsen
nl: Bewerk Lid

source: Home
fi: Koti
nl: Thuis

# languageIndex
source: Languages Index
fi: Kielet Hakemisto
nl: Talen Index

source: Languages
fi: Kielet
nl: Talen

source: Members
fi: Jäsenet
nl: Leden

source: Select Language
fi: Valittu Kieli
nl: Taal Kiezen

source: Log In
fi: Kirjaudu Sisään
nl: Aanmelden

source: Register
fi: Rrekisteröidä
nl: Registreren

source: Current Culture
fi: Nykyinen Kulttuuri
nl: Huidige Cultuur

source: Language
fi: Kieli
nl: Taal

# dbWritingError
source: Error writing to database
fi: Virhe kirjoitettaessa tietokantaan tietokanta
nl: Fout bij het schrijven naar de databank

# deleteError
source: Error trying to delete
fi: Virhe yrittää poistaa
nl: Fout probeert te verwijderen

# deleteFail
source: Deletion un-successful
fi: Poistetaan un - onnistunut
nl: Verwijdering un - succesvolle

# deleteSuccess
source: Deletion successful
fi: Poisto onnistunut
nl: Verwijdering succesvol

# editSuccess
source: Edit Successful
fi: Muokkaa Onnistunut
nl: Bewerken Succesvolle

# insertException
source: Exception on insert
fi: Poikkeus limityskohdista
nl: Uitzondering op insert

# phoneError
source: {0} should match the phone number pattern 123-123-1234
fi: {0} pitäisi vastatapuhelinnumero kuvio 123-123-1234
nl: {0} moet overeenkomen met het telefoonnummer patroon 123-123-1234

source: Save
fi: Pelastaa
nl: Besparen

source: Submit Query
fi: Esittää Tiedustelu
nl: voorleggen Voorleggen Vraag

# emailFormat
source: {0} must be similar format to: N_dahlquist@live.ca
fi: {0} on samanlainen formaatti : N_dahlquist@live.ca
nl: {0} moet vergelijkbaar formaat te zijn : N_dahlquist@live.ca

# integer
source: {0} must be numeric.
fi: {0} täytyy olla numeerinen.
nl: {0} moet numeriek zijn.

# integerEmpty
source: {0} must be numeric. {0} cannot be empty or just blanks.
fi: {0} täytyy olla numeerinen. {0} ei voi olla tyhjä tai vain aihioita .
nl: {0} moet numeriek zijn. {0} kan niet leeg zijn of alleen spaties .

# memberOnFile
source: Member with this ID already exists.
fi: Jäsen tällä tunnus on jo olemassa.
nl: Lid met dit ID bestaat reeds.

# postalRequiredFormat
source: {0} cannot be empty or just blanks. {0} must be 6-7 characters in length
fi: {0} ei voi olla tyhjä tai vain aihioita. {0} on oltava 6-7 merkkiä pitkä
nl: {0} kan niet leeg zijn of alleen spaties. {0} moet 6-7 tekens lang zijn

# provinceInvalid
source: Province code is not on file
fi: Maakunta -koodi ei ole tallessa
nl: Provincie code is niet in ons bestand

# provinceLength
source: Province code must be 2 letters in length
fi: Maakunta -koodi on 2 kirjainta pituudeltaan
nl: Provincie code moet 2 brieven lang zijn

# spouseFirstRequired
source: {0} is required if {1} is entered.
fi: {0} on tarpeen, jos {1} on tullut.
nl: {0} is vereist als {1} wordt ingevoerd.
